import React from "react";

function CoursTextDescription() {
  return (
    <div style={{ paddingLeft: "65px" ,flex:1}}>
      <div className="dotsandtext">
        <p style={{ fontFamily: "bold" }}>مقدمة عن المحاضرة</p>
        <div className="smallDot"></div>
        <p>نص المحاضرة</p>
        <div className="smallDot"></div>
        <p>الأسئلة الشائعة</p>
      </div>
      <div className="bigBar">
        <div className="smallBar"></div>
      </div>
      <div className="contentdescription"><p style={{ lineHeight: "120%" }}>
        نص حكيم له سر قاطع وذو شأن عظيم مكتوب على ثوب أخضر ومغلف بجلد أزرقص حكيم
        له سر قاطع وذو شأن عظيم مكتوب على ثوب أخضر ومغلف بجلد أزرقص حكيم له سر
        قاطع وذو شأن عظيم مكتوب على ثوب أخضر ومغلف بجلد أزرقص حكيم له سر قاطع
        وذو شأن عظيم مكتوب على ثوب أخضر ومغلف بجلد أزرقص حكيم له سر قاطع وذو شأن
        عظيم مكتوب على ثوب أخضر ومغلف بجلد أزرق{" "}
      </p>
      <p style={{ lineHeight: "120%" }}>
        . ص حكيم له سر قاطع وذو شأن عظيم مكتوب على ثوب أخضر ومغلف بجلد أزرقص
        حكيم له سر قاطع وذو شأن عظيم مكتوب على ثوب أخضر ومغلف بجلد أزرقص حكيم له
        سر قاطع وذو شأن عظيم مكتوب على ثوب أخضر ومغلف بجلد أزرقص حكيم له سر قاطع
        وذو شأن عظيم مكتوب على ثوب أخضر ومغلف بجلد أزرقص حكيم له سر قاطع وذو شأن
        عظيم مكتوب على ثوب أخضر ومغلف بجلد أزرقص حكيم له سر قاطع وذو شأن عظيم
        مكتوب على ثوب أخضر ومغلف بجلد أزرقص حكيم له سر قاطع وذو شأن عظيم مكتوب
        على ثوب أخضر ومغلف بجلد أزرق.
      </p>
      </div>
    </div>
  );
}

export default CoursTextDescription;
