const dummydata = {
  id: 1,
  title: "برنامج الاكاد الاكاد يميبر يميبر نامج الاكاديمي",
  description:
    "بربرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديمي... برنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد ...",
  start_date: "٢٠ أكتوبر",
  duration: "٣ أسابيع",
  learning_average: "٣ ساعات أسبوعيًا",
  program_image: "https://i.postimg.cc/wvtts2Jm/image1.png",
  time_recorded: 500,
  related_article: 5,
  program_completion: "شهادة",
  introduction:
    "بربرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديمي...مج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنامج الاكاد الاكاد يميبر يميبر نامج الاكاديميبرنا",
  skills_gained: [
    "المهارة الأولى",
    "المهارة الثانية",
    "المهارة الثالثة",
    "المهارة الرابعة",
    "المهارة الخامسة",
    "المهارة السادسة",
    "المهارة السابعة",
    "المهارة الثامنة",
    "المهارة التاسعة",
    "المهارة العاشرة",
  ],
  learning_process: [
    "مثال لأحد أهداف الدورة وسمثال لأحد أهداف الدورة وس",
    "مثال لأحد أهداف الدورة وسمثال لأحد أهداف الدورة وس",
    "مثال لأحد أهداف الدورة وسمثال لأحد أهداف الدورة وس",
    "مثال لأحد أهداف الدورة وسمثال لأحد أهداف الدورة وس",
  ],
  program_titles: [
    {
      name: "مقدمة عن البرنامة",
      label: "مقدمة عن البرنامة",
    },
    {
      name: "أساسيات الدورة",
      label: "أساسيات الدورة",
    },
    {
      name: "أساسيات الدورة ٢",
      label: "أساسيات الدورة ٢",
    },
    {
      name: "أساسيات الدورة ٣",
      label: "أساسيات الدورة ٣",
    },
  ],
  program_content: [
    {
      id: 1,
      label: "مقدمة عن البرنامة",
      title: "عنوان المقeeeeeeال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
    {
      id: 1,
      label: "أساسيات الدورة",
      title: "عنوان المقال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
    {
      id: 1,
      label: "أساسيات الدورة ٢",
      title: "عنوان المقال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
    {
      id: 1,
      label: "أساسيات الدورة ٣",
      title: "عنوان المقال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
    {
      id: 1,
      label: "مقدمة عن البرنامة",
      title: "عنوان المقال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
    {
      id: 1,
      label: "مقدمة عن البرنامة",
      title: "عنوان المقال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
    {
      id: 1,
      label: "أساسيات الدورة",
      title: "عنوان المقال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
    {
      id: 1,
      label: "أساسيات الدورة ٢",
      title: "عنوان المقال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
    {
      id: 1,
      label: "أساسيات الدورة ٣",
      title: "عنوان المقال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
    {
      id: 1,
      label: "مقدمة عن البرنامة",
      title: "عنوان المقال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
    {
      id: 1,
      label: "أساسيات الدورة",
      title: "عنوان المقال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
    {
      id: 1,
      label: "أساسيات الدورة ٢",
      title: "عنوان المقال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
    {
      id: 1,
      label: "أساسيات الدورة ٣",
      title: "عنوان المقال",
      description:
        "مثال لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق، لأحد أهداف الدورة وسيتم شرحها بشكل مفصل بوقت لاحق",
      image: "https://i.postimg.cc/wvtts2Jm/image1.png",
    },
  ],
};

export default dummydata;
